{"format": "layers-model", "generatedBy": "keras", "convertedBy": "manual", "modelTopology": {"keras_version": "2.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 63], "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 28, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["weights.bin"], "weights": [{"name": "dense/weight_0", "shape": [63, 256], "dtype": "float32"}, {"name": "dense/weight_1", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/weight_0", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/weight_1", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/weight_2", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/weight_3", "shape": [256], "dtype": "float32"}, {"name": "dense_1/weight_0", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_1/weight_1", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/weight_0", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/weight_1", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/weight_2", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/weight_3", "shape": [128], "dtype": "float32"}, {"name": "dense_2/weight_0", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_2/weight_1", "shape": [64], "dtype": "float32"}, {"name": "dense_3/weight_0", "shape": [64, 28], "dtype": "float32"}, {"name": "dense_3/weight_1", "shape": [28], "dtype": "float32"}]}]}